---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SubRegionFailures.NoHostForToposolidSubregion
source: html/22a279c7-90e2-b02e-ee45-65120079a363.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SubRegionFailures.NoHostForToposolidSubregion Property

This sub-division now does not appear to overlap any Toposolid with an appropriate Phase and Design Option.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoHostForToposolidSubregion { get; }
```